const mapping = [
	['A', 'あ'],
	['I', 'い'],
	['U', 'う'],
	['E', 'え'],
	['O', 'お'],
	['K', 'か・き・く・け・こ', [
		['A', 'か'], ['I', 'き'], ['U', 'く'], ['E', 'け'], ['O', 'こ'],
		['Y', 'きゃ・きゅ・きょ', [
			['A', 'きゃ'], ['U', 'きゅ'], ['O', 'きょ']
		]],
		['K', 'っ', 'K', { keep: true }]
	]],
	['S', 'さ・し・す・せ・そ', [
		['A', 'さ'], ['I', 'し'], ['U', 'す'], ['E', 'せ'], ['O', 'そ'],
		['Y', 'しゃ・しゅ・しょ', [
			['A', 'しゃ'], ['U', 'しゅ'], ['O', 'しょ']
		]],
		['H', null, [
			['A', 'しゃ'], ['I', 'し'], ['U', 'しゅ'], ['E', 'しぇ'], ['O', 'しょ']
		], { hidden: true }],
		['S', 'っ', 'S', { keep: true }]
	]],
	['T', 'た・ち・つ・て・と', [
		['A', 'た'], ['I', 'ち'], ['U', 'つ'], ['E', 'て'], ['O', 'と'],
		['Y', 'ちゃ・ちゅ・ちょ', [
			['A', 'ちゃ'], ['U', 'ちゅ'], ['O', 'ちょ']
		]],
		['S', null, [
			['A', 'つぁ'], ['I', 'つぃ'], ['U', 'つ'], ['E', 'つぇ'], ['O', 'つぉ']
		], { hidden: true }],
		['H', null, [
			['A', 'てゃ'], ['I', 'てぃ'], ['U', 'てゅ'], ['E', 'てぇ'], ['O', 'てょ']
		], { hidden: true }],
		['W', null, [
			['U', 'とぅ']
		], { hidden: true }],
		['T', 'っ', 'T', { keep: true }]
	]],
	['C', null, [
		['H', 'ちゃ・ち・ちゅ・ちぇ・ちょ', [
			['A', 'ちゃ'], ['I', 'ち'], ['U', 'ちゅ'], ['E', 'ちぇ'], ['O', 'ちょ']
		]],
		['C', 'っ', 'C', { keep: true }]
	], { hidden: true }],
	['N', 'な・に・ぬ・ね・の・ん', [
		['A', 'な'], ['I', 'に'], ['U', 'ぬ'], ['E', 'ね'], ['O', 'の'],
		['Y', 'にゃ・にゅ・にょ', [
			['A', 'にゃ'], ['U', 'にゅ'], ['O', 'にょ']
		]],
		['N', 'ん'],
		['K', 'ん', 'K', { hidden: true, fix: true }],
		['S', 'ん', 'S', { hidden: true, fix: true }],
		['T', 'ん', 'T', { hidden: true, fix: true }],
		['C', 'ん', 'C', { hidden: true, fix: true }],
		['H', 'ん', 'H', { hidden: true, fix: true }],
		['F', 'ん', 'F', { hidden: true, fix: true }],
		['M', 'ん', 'M', { hidden: true, fix: true }],
		['G', 'ん', 'G', { hidden: true, fix: true }],
		['Z', 'ん', 'Z', { hidden: true, fix: true }],
		['J', 'ん', 'J', { hidden: true, fix: true }],
		['D', 'ん', 'D', { hidden: true, fix: true }],
		['B', 'ん', 'B', { hidden: true, fix: true }],
		['P', 'ん', 'P', { hidden: true, fix: true }],
		['R', 'ん', 'R', { hidden: true, fix: true }],
		['W', 'ん', 'W', { hidden: true, fix: true }],
		['X', 'ん', 'X', { hidden: true, fix: true }],
		['L', 'ん', 'X', { hidden: true, fix: true }]
	]],
	['H', 'は・ひ・ふ・へ・ほ', [
		['A', 'は'], ['I', 'ひ'], ['U', 'ふ'], ['E', 'へ'], ['O', 'ほ'],
		['Y', 'ひゃ・ひゅ・ひょ', [
			['A', 'ひゃ'], ['U', 'ひゅ'], ['O', 'ひょ']
		]],
		['H', 'っ', 'H', { keep: true }]
	]],
	['F', null, [
		['A', 'ふぁ'], ['I', 'ふぃ'], ['U', 'ふ'], ['E', 'ふぇ'], ['O', 'ふぉ'],
		['F', 'っ', 'F', { keep: true }]
	], { hidden: true }],
	['M', 'ま・み・む・め・も', [
		['A', 'ま'], ['I', 'み'], ['U', 'む'], ['E', 'め'], ['O', 'も'],
		['Y', 'みゃ・みゅ・みょ', [
			['A', 'みゃ'], ['U', 'みゅ'], ['O', 'みょ']
		]],
		['M', 'っ', 'M', { keep: true }]
	]],
	['Y', 'や・ゆ・よ', [
		['A', 'や'], ['U', 'ゆ'], ['O', 'よ'],
		['Y', 'っ', 'Y', { keep: true }]
	]],
	['R', 'ら・り・る・れ・ろ', [
		['A', 'ら'], ['I', 'り'], ['U', 'る'], ['E', 'れ'], ['O', 'ろ'],
		['Y', 'りゃ・りゅ・りょ', [
			['A', 'りゃ'], ['U', 'りゅ'], ['O', 'りょ']
		]],
		['R', 'っ', 'R', { keep: true }]
	]],
	['W', 'わ・を', [
		['A', 'わ'], ['I', 'うぃ', null, { hidden: true }], ['E', 'うぇ', null, { hidden: true }], ['O', 'を'],
		['H', null, [
			['A', 'うぁ'], ['I', 'うぃ'], ['E', 'うぇ'], ['O', 'うぉ']
		], { hidden: true }],
		['W', 'っ', 'W', { keep: true }]
	]],
	['G', 'が・ぎ・ぐ・げ・ご', [
		['A', 'が'], ['I', 'ぎ'], ['U', 'ぐ'], ['E', 'げ'], ['O', 'ご'],
		['Y', 'ぎゃ・ぎゅ・ぎょ', [
			['A', 'ぎゃ'], ['U', 'ぎゅ'], ['O', 'ぎょ']
		]],
		['G', 'っ', 'G', { keep: true }]
	]],
	['Z', 'ざ・じ・ず・ぜ・ぞ', [
		['A', 'ざ'], ['I', 'じ'], ['U', 'ず'], ['E', 'ぜ'], ['O', 'ぞ'],
		['Y', 'じゃ・じゅ・じょ', [
			['A', 'じゃ'], ['U', 'じゅ'], ['O', 'じょ']
		]],
		['Z', 'っ', 'Z', { keep: true }]
	]],
	['J', null, [
		['A', 'じゃ'], ['I', 'じ'], ['U', 'じゅ'], ['E', 'じぇ'], ['O', 'じょ'],
		['Y', null, 'ZY', { hidden: true }],
		['J', 'っ', 'J', { keep: true }]
	], { hidden: true }],
	['D', 'だ・ぢ・づ・で・ど', [
		['A', 'だ'], ['I', 'ぢ'], ['U', 'づ'], ['E', 'で'], ['O', 'ど'],
		['Y', 'ぢゃ・ぢゅ・ぢょ', [
			['A', 'ぢゃ'], ['U', 'ぢゅ'], ['O', 'ぢょ']
		]],
		['H', null, [
			['A', 'でゃ'], ['I', 'でぃ'], ['U', 'でゅ'], ['E', 'でぇ'], ['O', 'てょ']
		], { hidden: true }],
		['W', null, [
			['U', 'どぅ']
		], { hidden: true }],
		['D', 'っ', 'D', { keep: true }]
	]],
	['B', 'ば・び・ぶ・べ・ぼ', [
		['A', 'ば'], ['I', 'び'], ['U', 'ぶ'], ['E', 'べ'], ['O', 'ぼ'],
		['Y', 'びゃ・びゅ・びょ', [
			['A', 'びゃ'], ['U', 'びゅ'], ['O', 'びょ']
		]],
		['B', 'っ', 'B', { keep: true }]
	]],
	['P', 'ぱ・ぴ・ぷ・ぺ・ぽ', [
		['A', 'ぱ'], ['I', 'ぴ'], ['U', 'ぷ'], ['E', 'ぺ'], ['O', 'ぽ'],
		['Y', 'ぴゃ・ぴゅ・ぴょ', [
			['A', 'ぴゃ'], ['U', 'ぴゅ'], ['O', 'ぴょ']
		]],
		['P', 'っ', 'P', { keep: true }]
	]],
	['X', null, [
		['A', 'ぁ'], ['I', 'ぃ'], ['U', 'ぅ'], ['E', 'ぇ'], ['O', 'ぉ'],
		['T', 'っ', [
			['U', 'っ'],
			['S', null, [
				['U', 'っ']
			], { hidden: true }]
		]],
		['Y', 'ゃ・ゅ・ょ', [
			['A', 'ゃ'], ['U', 'ゅ'], ['O', 'ょ']
		]]
	], { hidden: true }],
	['L', null, 'X', { hidden: true }],
	['0', '０', null, { hidden: true }],
	['1', '１', null, { hidden: true }],
	['2', '２', null, { hidden: true }],
	['3', '３', null, { hidden: true }],
	['4', '４', null, { hidden: true }],
	['5', '５', null, { hidden: true }],
	['6', '６', null, { hidden: true }],
	['7', '７', null, { hidden: true }],
	['8', '８', null, { hidden: true }],
	['9', '９', null, { hidden: true }],
	['-', 'ー', null, { hidden: true }],
	[',', '、', null, { hidden: true }],
	['.', '。', null, { hidden: true }],
	['[', '「', null, { hidden: true }],
	[']', '」', null, { hidden: true }],
	['/', '・', null, { hidden: true }],
	[' ', '　', null, { hidden: true }]
];

export { mapping };
